RT-Thread/rt-thread/bsp/stm32/libraries/STM32H5xx_HAL/STM32H5xx_HAL_Driver/Inc/stm32h5xx_hal_rcc.h
/** @defgroup RCC_System_Clock_Source System Clock Source
  * @{
  */
#define RCC_SYSCLKSOURCE_HSI             (0x00000000U)                      /*!< HSI selection as system clock */
#define RCC_SYSCLKSOURCE_CSI             RCC_CFGR1_SW_0                     /*!< CSI selection as system clock */
#define RCC_SYSCLKSOURCE_HSE             RCC_CFGR1_SW_1                     /*!< HSE selection as system clock */
#define RCC_SYSCLKSOURCE_PLLCLK          (RCC_CFGR1_SW_0 | RCC_CFGR1_SW_1)  /*!< PLL1 selection as system clock */
/**
  * @}
  */

/** @defgroup RCC_System_Clock_Source_Status System Clock Source Status
  * @{
  */
#define RCC_SYSCLKSOURCE_STATUS_HSI      (0x00000000U)                       /*!< HSI used as system clock */
#define RCC_SYSCLKSOURCE_STATUS_CSI      RCC_CFGR1_SWS_0                     /*!< CSI used as system clock */
#define RCC_SYSCLKSOURCE_STATUS_HSE      RCC_CFGR1_SWS_1                     /*!< HSE used as system clock */
#define RCC_SYSCLKSOURCE_STATUS_PLLCLK   (RCC_CFGR1_SWS_0 | RCC_CFGR1_SWS_1) /*!< PLL1 used as system clock */
/**
  * @}
  */

/** @defgroup RCC_AHB_Clock_Source AHB Clock Source
  * @{
  */
#define RCC_SYSCLK_DIV1                (0x00000000U)                                                                /*!< SYSCLK not divided */
#define RCC_SYSCLK_DIV2                RCC_CFGR2_HPRE_3                                                             /*!< SYSCLK divided by 2 */
#define RCC_SYSCLK_DIV4                (RCC_CFGR2_HPRE_0 | RCC_CFGR2_HPRE_3)                                        /*!< SYSCLK divided by 4 */
#define RCC_SYSCLK_DIV8                (RCC_CFGR2_HPRE_1 | RCC_CFGR2_HPRE_3)                                        /*!< SYSCLK divided by 8 */
#define RCC_SYSCLK_DIV16               (RCC_CFGR2_HPRE_0 | RCC_CFGR2_HPRE_1 | RCC_CFGR2_HPRE_3)                     /*!< SYSCLK divided by 16 */
#define RCC_SYSCLK_DIV64               (RCC_CFGR2_HPRE_2 | RCC_CFGR2_HPRE_3)                                        /*!< SYSCLK divided by 64 */
#define RCC_SYSCLK_DIV128              (RCC_CFGR2_HPRE_0 | RCC_CFGR2_HPRE_2 | RCC_CFGR2_HPRE_3)                     /*!< SYSCLK divided by 128 */
#define RCC_SYSCLK_DIV256              (RCC_CFGR2_HPRE_1 | RCC_CFGR2_HPRE_2 | RCC_CFGR2_HPRE_3)                     /*!< SYSCLK divided by 256 */
#define RCC_SYSCLK_DIV512              (RCC_CFGR2_HPRE_0 | RCC_CFGR2_HPRE_1  | RCC_CFGR2_HPRE_2 | RCC_CFGR2_HPRE_3) /*!< SYSCLK divided by 512 */
/**
  * @}
  */

/** @defgroup RCC_APB1_APB2_APB3_Clock_Source APB1 APB2 APB3 Clock Source
  * @{
  */
#define RCC_HCLK_DIV1                  (0x00000000U)                                               /*!< HCLK not divided */
#define RCC_HCLK_DIV2                  RCC_CFGR2_PPRE1_2                                           /*!< HCLK divided by 2 */
#define RCC_HCLK_DIV4                  (RCC_CFGR2_PPRE1_0 | RCC_CFGR2_PPRE1_2)                     /*!< HCLK divided by 4 */
#define RCC_HCLK_DIV8                  (RCC_CFGR2_PPRE1_1 | RCC_CFGR2_PPRE1_2)                     /*!< HCLK divided by 8 */
#define RCC_HCLK_DIV16                 (RCC_CFGR2_PPRE1_0 | RCC_CFGR2_PPRE1_1 | RCC_CFGR2_PPRE1_2) /*!< HCLK divided by 16 */
/**
  * @}
  */

/** @defgroup RCC_HAL_EC_RTC_HSE_DIV RTC HSE Prescaler
  * @{
  */
#define RCC_RTC_HSE_NOCLOCK            (0x00000000U)
#define RCC_RTC_HSE_DIV2               (0x00000200U)
#define RCC_RTC_HSE_DIV3               (0x00000300U)
#define RCC_RTC_HSE_DIV4               (0x00000400U)
#define RCC_RTC_HSE_DIV5               (0x00000500U)
#define RCC_RTC_HSE_DIV6               (0x00000600U)
#define RCC_RTC_HSE_DIV7               (0x00000700U)
#define RCC_RTC_HSE_DIV8               (0x00000800U)
#define RCC_RTC_HSE_DIV9               (0x00000900U)
#define RCC_RTC_HSE_DIV10              (0x00000A00U)
#define RCC_RTC_HSE_DIV11              (0x00000B00U)
#define RCC_RTC_HSE_DIV12              (0x00000C00U)
#define RCC_RTC_HSE_DIV13              (0x00000D00U)
#define RCC_RTC_HSE_DIV14              (0x00000E00U)
#define RCC_RTC_HSE_DIV15              (0x00000F00U)
#define RCC_RTC_HSE_DIV16              (0x00001000U)
#define RCC_RTC_HSE_DIV17              (0x00001100U)
#define RCC_RTC_HSE_DIV18              (0x00001200U)
#define RCC_RTC_HSE_DIV19              (0x00001300U)
#define RCC_RTC_HSE_DIV20              (0x00001400U)
#define RCC_RTC_HSE_DIV21              (0x00001500U)
#define RCC_RTC_HSE_DIV22              (0x00001600U)
#define RCC_RTC_HSE_DIV23              (0x00001700U)
#define RCC_RTC_HSE_DIV24              (0x00001800U)
#define RCC_RTC_HSE_DIV25              (0x00001900U)
#define RCC_RTC_HSE_DIV26              (0x00001A00U)
#define RCC_RTC_HSE_DIV27              (0x00001B00U)
#define RCC_RTC_HSE_DIV28              (0x00001C00U)
#define RCC_RTC_HSE_DIV29              (0x00001D00U)
#define RCC_RTC_HSE_DIV30              (0x00001E00U)
#define RCC_RTC_HSE_DIV31              (0x00001F00U)
#define RCC_RTC_HSE_DIV32              (0x00002000U)
#define RCC_RTC_HSE_DIV33              (0x00002100U)
#define RCC_RTC_HSE_DIV34              (0x00002200U)
#define RCC_RTC_HSE_DIV35              (0x00002300U)
#define RCC_RTC_HSE_DIV36              (0x00002400U)
#define RCC_RTC_HSE_DIV37              (0x00002500U)
#define RCC_RTC_HSE_DIV38              (0x00002600U)
#define RCC_RTC_HSE_DIV39              (0x00002700U)
#define RCC_RTC_HSE_DIV40              (0x00002800U)
#define RCC_RTC_HSE_DIV41              (0x00002900U)
#define RCC_RTC_HSE_DIV42              (0x00002A00U)
#define RCC_RTC_HSE_DIV43              (0x00002B00U)
#define RCC_RTC_HSE_DIV44              (0x00002C00U)
#define RCC_RTC_HSE_DIV45              (0x00002D00U)
#define RCC_RTC_HSE_DIV46              (0x00002E00U)
#define RCC_RTC_HSE_DIV47              (0x00002F00U)
#define RCC_RTC_HSE_DIV48              (0x00003000U)
#define RCC_RTC_HSE_DIV49              (0x00003100U)
#define RCC_RTC_HSE_DIV50              (0x00003200U)
#define RCC_RTC_HSE_DIV51              (0x00003300U)
#define RCC_RTC_HSE_DIV52              (0x00003400U)
#define RCC_RTC_HSE_DIV53              (0x00003500U)
#define RCC_RTC_HSE_DIV54              (0x00003600U)
#define RCC_RTC_HSE_DIV55              (0x00003700U)
#define RCC_RTC_HSE_DIV56              (0x00003800U)
#define RCC_RTC_HSE_DIV57              (0x00003900U)
#define RCC_RTC_HSE_DIV58              (0x00003A00U)
#define RCC_RTC_HSE_DIV59              (0x00003B00U)
#define RCC_RTC_HSE_DIV60              (0x00003C00U)
#define RCC_RTC_HSE_DIV61              (0x00003D00U)
#define RCC_RTC_HSE_DIV62              (0x00003E00U)
#define RCC_RTC_HSE_DIV63              (0x00003F00U)
/**
  * @}
  */

