RT-Thread/rt-thread/bsp/stm32/libraries/STM32H5xx_HAL/STM32H5xx_HAL_Driver/Inc/stm32h5xx_hal_rcc.h
/** @defgroup RCC_RTC_Clock_Source RTC Clock Source
  * @{
  */
#define RCC_RTCCLKSOURCE_NO_CLK        (0x00000000U)       /*!< No clock used as RTC clock source */
#define RCC_RTCCLKSOURCE_LSE           (0x00000100U)       /*!< LSE oscillator clock used as RTC clock source */
#define RCC_RTCCLKSOURCE_LSI           (0x00000200U)       /*!< LSI oscillator clock used as RTC clock source */
#define RCC_RTCCLKSOURCE_HSE_DIVx      (0x00000300U)       /*!< HSE oscillator clock divided by X used as RTC clock source */
#define RCC_RTCCLKSOURCE_HSE_DIV2      (0x00002300U)
#define RCC_RTCCLKSOURCE_HSE_DIV3      (0x00003300U)
#define RCC_RTCCLKSOURCE_HSE_DIV4      (0x00004300U)
#define RCC_RTCCLKSOURCE_HSE_DIV5      (0x00005300U)
#define RCC_RTCCLKSOURCE_HSE_DIV6      (0x00006300U)
#define RCC_RTCCLKSOURCE_HSE_DIV7      (0x00007300U)
#define RCC_RTCCLKSOURCE_HSE_DIV8      (0x00008300U)
#define RCC_RTCCLKSOURCE_HSE_DIV9      (0x00009300U)
#define RCC_RTCCLKSOURCE_HSE_DIV10     (0x0000A300U)
#define RCC_RTCCLKSOURCE_HSE_DIV11     (0x0000B300U)
#define RCC_RTCCLKSOURCE_HSE_DIV12     (0x0000C300U)
#define RCC_RTCCLKSOURCE_HSE_DIV13     (0x0000D300U)
#define RCC_RTCCLKSOURCE_HSE_DIV14     (0x0000E300U)
#define RCC_RTCCLKSOURCE_HSE_DIV15     (0x0000F300U)
#define RCC_RTCCLKSOURCE_HSE_DIV16     (0x00010300U)
#define RCC_RTCCLKSOURCE_HSE_DIV17     (0x00011300U)
#define RCC_RTCCLKSOURCE_HSE_DIV18     (0x00012300U)
#define RCC_RTCCLKSOURCE_HSE_DIV19     (0x00013300U)
#define RCC_RTCCLKSOURCE_HSE_DIV20     (0x00014300U)
#define RCC_RTCCLKSOURCE_HSE_DIV21     (0x00015300U)
#define RCC_RTCCLKSOURCE_HSE_DIV22     (0x00016300U)
#define RCC_RTCCLKSOURCE_HSE_DIV23     (0x00017300U)
#define RCC_RTCCLKSOURCE_HSE_DIV24     (0x00018300U)
#define RCC_RTCCLKSOURCE_HSE_DIV25     (0x00019300U)
#define RCC_RTCCLKSOURCE_HSE_DIV26     (0x0001A300U)
#define RCC_RTCCLKSOURCE_HSE_DIV27     (0x0001B300U)
#define RCC_RTCCLKSOURCE_HSE_DIV28     (0x0001C300U)
#define RCC_RTCCLKSOURCE_HSE_DIV29     (0x0001D300U)
#define RCC_RTCCLKSOURCE_HSE_DIV30     (0x0001E300U)
#define RCC_RTCCLKSOURCE_HSE_DIV31     (0x0001F300U)
#define RCC_RTCCLKSOURCE_HSE_DIV32     (0x00020300U)
#define RCC_RTCCLKSOURCE_HSE_DIV33     (0x00021300U)
#define RCC_RTCCLKSOURCE_HSE_DIV34     (0x00022300U)
#define RCC_RTCCLKSOURCE_HSE_DIV35     (0x00023300U)
#define RCC_RTCCLKSOURCE_HSE_DIV36     (0x00024300U)
#define RCC_RTCCLKSOURCE_HSE_DIV37     (0x00025300U)
#define RCC_RTCCLKSOURCE_HSE_DIV38     (0x00026300U)
#define RCC_RTCCLKSOURCE_HSE_DIV39     (0x00027300U)
#define RCC_RTCCLKSOURCE_HSE_DIV40     (0x00028300U)
#define RCC_RTCCLKSOURCE_HSE_DIV41     (0x00029300U)
#define RCC_RTCCLKSOURCE_HSE_DIV42     (0x0002A300U)
#define RCC_RTCCLKSOURCE_HSE_DIV43     (0x0002B300U)
#define RCC_RTCCLKSOURCE_HSE_DIV44     (0x0002C300U)
#define RCC_RTCCLKSOURCE_HSE_DIV45     (0x0002D300U)
#define RCC_RTCCLKSOURCE_HSE_DIV46     (0x0002E300U)
#define RCC_RTCCLKSOURCE_HSE_DIV47     (0x0002F300U)
#define RCC_RTCCLKSOURCE_HSE_DIV48     (0x00030300U)
#define RCC_RTCCLKSOURCE_HSE_DIV49     (0x00031300U)
#define RCC_RTCCLKSOURCE_HSE_DIV50     (0x00032300U)
#define RCC_RTCCLKSOURCE_HSE_DIV51     (0x00033300U)
#define RCC_RTCCLKSOURCE_HSE_DIV52     (0x00034300U)
#define RCC_RTCCLKSOURCE_HSE_DIV53     (0x00035300U)
#define RCC_RTCCLKSOURCE_HSE_DIV54     (0x00036300U)
#define RCC_RTCCLKSOURCE_HSE_DIV55     (0x00037300U)
#define RCC_RTCCLKSOURCE_HSE_DIV56     (0x00038300U)
#define RCC_RTCCLKSOURCE_HSE_DIV57     (0x00039300U)
#define RCC_RTCCLKSOURCE_HSE_DIV58     (0x0003A300U)
#define RCC_RTCCLKSOURCE_HSE_DIV59     (0x0003B300U)
#define RCC_RTCCLKSOURCE_HSE_DIV60     (0x0003C300U)
#define RCC_RTCCLKSOURCE_HSE_DIV61     (0x0003D300U)
#define RCC_RTCCLKSOURCE_HSE_DIV62     (0x0003E300U)
#define RCC_RTCCLKSOURCE_HSE_DIV63     (0x0003F300U)
/**
  * @}
  */

/** @defgroup RCC_MCO_Index MCO Index
  * @{
  */
#define RCC_MCO1                       (0x00000000U)
#define RCC_MCO2                       (0x00000001U)
/**
  * @}
  */

/** @defgroup RCC_MCO1_Clock_Source  RCC MCO1 Clock Source
  * @{
  */
#define RCC_MCO1SOURCE_HSI               (0x00000000U)
#define RCC_MCO1SOURCE_LSE               RCC_CFGR1_MCO1SEL_0
#define RCC_MCO1SOURCE_HSE               RCC_CFGR1_MCO1SEL_1
#define RCC_MCO1SOURCE_PLL1Q            ((uint32_t)RCC_CFGR1_MCO1SEL_0 | RCC_CFGR1_MCO1SEL_1)
#define RCC_MCO1SOURCE_HSI48             RCC_CFGR1_MCO1SEL_2

/**
  * @}
  */

/** @defgroup RCC_MCO2_Clock_Source  RCC MCO2 Clock Source
  * @{
  */
#define RCC_MCO2SOURCE_SYSCLK           (0x00000000U)
#define RCC_MCO2SOURCE_PLL2P            RCC_CFGR1_MCO2SEL_0
#define RCC_MCO2SOURCE_HSE              RCC_CFGR1_MCO2SEL_1
#define RCC_MCO2SOURCE_PLL1P           ((uint32_t)RCC_CFGR1_MCO2SEL_0 | RCC_CFGR1_MCO2SEL_1)
#define RCC_MCO2SOURCE_CSI              RCC_CFGR1_MCO2SEL_2
#define RCC_MCO2SOURCE_LSI             ((uint32_t)RCC_CFGR1_MCO2SEL_0 | RCC_CFGR1_MCO2SEL_2)

/**
  * @}
  */

/** @defgroup RCC_MCOx_Clock_Prescaler MCOx Clock Prescaler
  * @{
  */
#define RCC_MCODIV_1                    RCC_CFGR1_MCO1PRE_0
#define RCC_MCODIV_2                    RCC_CFGR1_MCO1PRE_1
#define RCC_MCODIV_3                    ((uint32_t)RCC_CFGR1_MCO1PRE_0 | RCC_CFGR1_MCO1PRE_1)
#define RCC_MCODIV_4                    RCC_CFGR1_MCO1PRE_2
#define RCC_MCODIV_5                    ((uint32_t)RCC_CFGR1_MCO1PRE_0 | RCC_CFGR1_MCO1PRE_2)
#define RCC_MCODIV_6                    ((uint32_t)RCC_CFGR1_MCO1PRE_1 | RCC_CFGR1_MCO1PRE_2)
#define RCC_MCODIV_7                    ((uint32_t)RCC_CFGR1_MCO1PRE_0 | RCC_CFGR1_MCO1PRE_1 | RCC_CFGR1_MCO1PRE_2)
#define RCC_MCODIV_8                    RCC_CFGR1_MCO1PRE_3
#define RCC_MCODIV_9                    ((uint32_t)RCC_CFGR1_MCO1PRE_0 | RCC_CFGR1_MCO1PRE_3)
#define RCC_MCODIV_10                   ((uint32_t)RCC_CFGR1_MCO1PRE_1 | RCC_CFGR1_MCO1PRE_3)
#define RCC_MCODIV_11                   ((uint32_t)RCC_CFGR1_MCO1PRE_0 | RCC_CFGR1_MCO1PRE_1 | RCC_CFGR1_MCO1PRE_3)
#define RCC_MCODIV_12                   ((uint32_t)RCC_CFGR1_MCO1PRE_2 | RCC_CFGR1_MCO1PRE_3)
#define RCC_MCODIV_13                   ((uint32_t)RCC_CFGR1_MCO1PRE_0 | RCC_CFGR1_MCO1PRE_2 | RCC_CFGR1_MCO1PRE_3)
#define RCC_MCODIV_14                   ((uint32_t)RCC_CFGR1_MCO1PRE_1 | RCC_CFGR1_MCO1PRE_2 | RCC_CFGR1_MCO1PRE_3)
#define RCC_MCODIV_15                   RCC_CFGR1_MCO1PRE
/**
  * @}
  */

/** @defgroup RCC_Interrupt Interrupts
  * @{
  */
#define RCC_IT_LSIRDY                  RCC_CIFR_LSIRDYF      /*!< LSI Ready Interrupt flag */
#define RCC_IT_LSERDY                  RCC_CIFR_LSERDYF      /*!< LSE Ready Interrupt flag */
#define RCC_IT_CSIRDY                  RCC_CIFR_CSIRDYF      /*!< CSI Ready Interrupt flag */
#define RCC_IT_HSIRDY                  RCC_CIFR_HSIRDYF      /*!< HSI16 Ready Interrupt flag */
#define RCC_IT_HSERDY                  RCC_CIFR_HSERDYF      /*!< HSE Ready Interrupt flag */
#define RCC_IT_HSI48RDY                RCC_CIFR_HSI48RDYF    /*!< HSI48 Ready Interrupt flag */
#define RCC_IT_PLL1RDY                 RCC_CIFR_PLL1RDYF     /*!< PLL1 Ready Interrupt flag */
#define RCC_IT_PLL2RDY                 RCC_CIFR_PLL2RDYF     /*!< PLL2 Ready Interrupt flag */
#if defined(RCC_CR_PLL3ON)
#define RCC_IT_PLL3RDY                 RCC_CIFR_PLL3RDYF     /*!< PLL3 Ready Interrupt flag */
#endif /* RCC_CR_PLL3ON */
#define RCC_IT_HSECSS                  RCC_CIFR_HSECSSF      /*!< HSE Clock Security System Interrupt flag */

/**
  * @}
  */

/** @defgroup RCC_Flag Flags
  *        Elements values convention: XXXYYYYYb
  *           - YYYYY  : Flag position in the register
  *           - XXX  : Register index
  *                 - 001: CR register
  *                 - 010: BDCR register
  *                 - 011: RSR register
  * @{
  */
/* Flags in the CR register */
#define RCC_FLAG_CSIRDY                ((uint32_t)((RCC_CR_REG_INDEX << 5U) | RCC_CR_CSIRDY_Pos))   /*!< CSI Ready flag */
#define RCC_FLAG_HSIRDY                ((uint32_t)((RCC_CR_REG_INDEX << 5U) | RCC_CR_HSIRDY_Pos))   /*!< HSI Ready flag */
#define RCC_FLAG_HSIDIVF               ((uint32_t)((RCC_CR_REG_INDEX << 5U) | RCC_CR_HSIDIVF_Pos))  /*!< HSI divider flag */
#define RCC_FLAG_HSERDY                ((uint32_t)((RCC_CR_REG_INDEX << 5U) | RCC_CR_HSERDY_Pos))   /*!< HSE Ready flag */
#define RCC_FLAG_PLL1RDY               ((uint32_t)((RCC_CR_REG_INDEX << 5U) | RCC_CR_PLL1RDY_Pos))  /*!< PLL1 Ready flag */
#define RCC_FLAG_PLL2RDY               ((uint32_t)((RCC_CR_REG_INDEX << 5U) | RCC_CR_PLL2RDY_Pos))  /*!< PLL2 Ready flag */
#if defined(RCC_CR_PLL3ON)
#define RCC_FLAG_PLL3RDY               ((uint32_t)((RCC_CR_REG_INDEX << 5U) | RCC_CR_PLL3RDY_Pos))  /*!< PLL3 Ready flag */
#endif /* RCC_CR_PLL3ON */
#define RCC_FLAG_HSI48RDY              ((uint32_t)((RCC_CR_REG_INDEX << 5U) | RCC_CR_HSI48RDY_Pos)) /*!< HSI48 Ready flag */

/* Flags in the BDCR register */
#define RCC_FLAG_LSERDY                ((uint32_t)((RCC_BDCR_REG_INDEX << 5U) | RCC_BDCR_LSERDY_Pos))  /*!< LSE Ready flag */
#define RCC_FLAG_LSECSSD               ((uint32_t)((RCC_BDCR_REG_INDEX << 5U) | RCC_BDCR_LSECSSD_Pos)) /*!< LSE Clock Security System Interrupt flag */
#define RCC_FLAG_LSIRDY                ((uint32_t)((RCC_BDCR_REG_INDEX << 5U) | RCC_BDCR_LSIRDY_Pos))  /*!< LSI Ready flag */

/* Flags in the RSR register */
#define RCC_FLAG_RMVF                  ((uint32_t)((RCC_RSR_REG_INDEX << 5U) | RCC_RSR_RMVF_Pos))     /*!< Remove reset flag */
#define RCC_FLAG_PINRST                ((uint32_t)((RCC_RSR_REG_INDEX << 5U) | RCC_RSR_PINRSTF_Pos))  /*!< PIN reset flag */
#define RCC_FLAG_BORRST                ((uint32_t)((RCC_RSR_REG_INDEX << 5U) | RCC_RSR_BORRSTF_Pos))  /*!< BOR reset flag */
#define RCC_FLAG_SFTRST                ((uint32_t)((RCC_RSR_REG_INDEX << 5U) | RCC_RSR_SFTRSTF_Pos))  /*!< Software Reset flag */
#define RCC_FLAG_IWDGRST               ((uint32_t)((RCC_RSR_REG_INDEX << 5U) | RCC_RSR_IWDGRSTF_Pos)) /*!< Independent Watchdog reset flag */
#define RCC_FLAG_WWDGRST               ((uint32_t)((RCC_RSR_REG_INDEX << 5U) | RCC_RSR_WWDGRSTF_Pos)) /*!< Window watchdog reset flag */
#define RCC_FLAG_LPWRRST               ((uint32_t)((RCC_RSR_REG_INDEX << 5U) | RCC_RSR_LPWRRSTF_Pos)) /*!< Low-Power reset flag */

/**
  * @}
  */

/** @defgroup RCC_Reset_Flag Reset Flag
  * @{
  */
#define RCC_RESET_FLAG_PIN             RCC_RSR_PINRSTF    /*!< PIN reset flag */
#define RCC_RESET_FLAG_PWR             RCC_RSR_BORRSTF    /*!< BOR or POR/PDR reset flag */
#define RCC_RESET_FLAG_SW              RCC_RSR_SFTRSTF    /*!< Software Reset flag */
#define RCC_RESET_FLAG_IWDG            RCC_RSR_IWDGRSTF   /*!< Independent Watchdog reset flag */
#define RCC_RESET_FLAG_WWDG            RCC_RSR_WWDGRSTF   /*!< Window watchdog reset flag */
#define RCC_RESET_FLAG_LPWR            RCC_RSR_LPWRRSTF   /*!< Low power reset flag */
#define RCC_RESET_FLAG_ALL             (RCC_RESET_FLAG_PIN | RCC_RESET_FLAG_PWR | RCC_RESET_FLAG_SW | \
                                        RCC_RESET_FLAG_IWDG | RCC_RESET_FLAG_WWDG | RCC_RESET_FLAG_LPWR)
/**
  * @}
  */

/** @defgroup RCC_LSEDrive_Config LSE Drive Config
  * @{
  */
#define RCC_LSEDRIVE_LOW                 (0x00000000U)          /*!< LSE low drive capability */
#define RCC_LSEDRIVE_MEDIUMLOW           RCC_BDCR_LSEDRV_0      /*!< LSE medium low drive capability */
#define RCC_LSEDRIVE_MEDIUMHIGH          RCC_BDCR_LSEDRV_1      /*!< LSE medium high drive capability */
#define RCC_LSEDRIVE_HIGH                RCC_BDCR_LSEDRV        /*!< LSE high drive capability */
/**
  * @}
  */

