RT-Thread/rt-thread/bsp/stm32/libraries/STM32H5xx_HAL/STM32H5xx_HAL_Driver/Inc/stm32h5xx_hal_rcc.h
#if defined(USART11)
#define __HAL_RCC_USART11_CLK_ENABLE()           do { \
                                                      __IO uint32_t tmpreg; \
                                                      SET_BIT(RCC->APB1LENR, RCC_APB1LENR_USART11EN); \
                                                      /* Delay after an RCC peripheral clock enabling */ \
                                                      tmpreg = READ_BIT(RCC->APB1LENR, RCC_APB1LENR_USART11EN); \
                                                      UNUSED(tmpreg); \
                                                    } while(0)
#endif /* USART11 */

#if defined(CEC)
#define __HAL_RCC_CEC_CLK_ENABLE()               do { \
                                                      __IO uint32_t tmpreg; \
                                                      SET_BIT(RCC->APB1LENR, RCC_APB1LENR_CECEN); \
                                                      /* Delay after an RCC peripheral clock enabling */ \
                                                      tmpreg = READ_BIT(RCC->APB1LENR, RCC_APB1LENR_CECEN); \
                                                      UNUSED(tmpreg); \
                                                    } while(0)
#endif /* CEC */

#if defined(UART7)
#define __HAL_RCC_UART7_CLK_ENABLE()             do { \
                                                      __IO uint32_t tmpreg; \
                                                      SET_BIT(RCC->APB1LENR, RCC_APB1LENR_UART7EN); \
                                                      /* Delay after an RCC peripheral clock enabling */ \
                                                      tmpreg = READ_BIT(RCC->APB1LENR, RCC_APB1LENR_UART7EN); \
                                                      UNUSED(tmpreg); \
                                                    } while(0)
#endif /* UART7 */

#if defined(UART8)
#define __HAL_RCC_UART8_CLK_ENABLE()             do { \
                                                      __IO uint32_t tmpreg; \
                                                      SET_BIT(RCC->APB1LENR, RCC_APB1LENR_UART8EN); \
                                                      /* Delay after an RCC peripheral clock enabling */ \
                                                      tmpreg = READ_BIT(RCC->APB1LENR, RCC_APB1LENR_UART8EN); \
                                                      UNUSED(tmpreg); \
                                                    } while(0)
#endif /* UART8 */

#if defined(UART9)
#define __HAL_RCC_UART9_CLK_ENABLE()             do { \
                                                      __IO uint32_t tmpreg; \
                                                      SET_BIT(RCC->APB1HENR, RCC_APB1HENR_UART9EN); \
                                                      /* Delay after an RCC peripheral clock enabling */ \
                                                      tmpreg = READ_BIT(RCC->APB1HENR, RCC_APB1HENR_UART9EN); \
                                                      UNUSED(tmpreg); \
                                                    } while(0)
#endif /* UART9 */

#if defined(UART12)
#define __HAL_RCC_UART12_CLK_ENABLE()             do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB1HENR, RCC_APB1HENR_UART12EN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB1HENR, RCC_APB1HENR_UART12EN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)
#endif /* UART12 */

#define __HAL_RCC_DTS_CLK_ENABLE()             do { \
                                                    __IO uint32_t tmpreg; \
                                                    SET_BIT(RCC->APB1HENR, RCC_APB1HENR_DTSEN); \
                                                    /* Delay after an RCC peripheral clock enabling */ \
                                                    tmpreg = READ_BIT(RCC->APB1HENR, RCC_APB1HENR_DTSEN); \
                                                    UNUSED(tmpreg); \
                                                  } while(0)

#define __HAL_RCC_LPTIM2_CLK_ENABLE()             do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB1HENR, RCC_APB1HENR_LPTIM2EN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB1HENR, RCC_APB1HENR_LPTIM2EN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#define __HAL_RCC_FDCAN_CLK_ENABLE()              do { \
                                                        __IO uint32_t tmpreg; \
                                                        SET_BIT(RCC->APB1HENR, RCC_APB1HENR_FDCANEN); \
                                                        /* Delay after an RCC peripheral clock enabling */ \
                                                        tmpreg = READ_BIT(RCC->APB1HENR, RCC_APB1HENR_FDCANEN); \
                                                        UNUSED(tmpreg); \
                                                     } while(0)

#if defined(UCPD1)
#define __HAL_RCC_UCPD1_CLK_ENABLE()            do { \
                                                     __IO uint32_t tmpreg; \
                                                     SET_BIT(RCC->APB1HENR, RCC_APB1HENR_UCPD1EN); \
                                                     /* Delay after an RCC peripheral clock enabling */ \
                                                     tmpreg = READ_BIT(RCC->APB1HENR, RCC_APB1HENR_UCPD1EN); \
                                                     UNUSED(tmpreg); \
                                                   } while(0)
#endif /* UCPD1 */

#define __HAL_RCC_TIM2_CLK_DISABLE()        CLEAR_BIT(RCC->APB1LENR, RCC_APB1LENR_TIM2EN)

#define __HAL_RCC_TIM3_CLK_DISABLE()        CLEAR_BIT(RCC->APB1LENR, RCC_APB1LENR_TIM3EN)

#if defined(TIM4)
#define __HAL_RCC_TIM4_CLK_DISABLE()        CLEAR_BIT(RCC->APB1LENR, RCC_APB1LENR_TIM4EN)
#endif /* TIM4 */

#if defined(TIM5)
#define __HAL_RCC_TIM5_CLK_DISABLE()        CLEAR_BIT(RCC->APB1LENR, RCC_APB1LENR_TIM5EN)
#endif /* TIM5 */

#define __HAL_RCC_TIM6_CLK_DISABLE()        CLEAR_BIT(RCC->APB1LENR, RCC_APB1LENR_TIM6EN)

