RT-Thread/rt-thread/bsp/stm32/libraries/STM32H5xx_HAL/STM32H5xx_HAL_Driver/Inc/stm32h5xx_hal_rcc.h
#if defined(LPTIM5)
#define __HAL_RCC_LPTIM5_CLK_ENABLE()           do { \
                                                     __IO uint32_t tmpreg; \
                                                     SET_BIT(RCC->APB3ENR, RCC_APB3ENR_LPTIM5EN); \
                                                     /* Delay after an RCC peripheral clock enabling */ \
                                                     tmpreg = READ_BIT(RCC->APB3ENR, RCC_APB3ENR_LPTIM5EN); \
                                                     UNUSED(tmpreg); \
                                                   } while(0)
#endif /* LPTIM5 */

#if defined(LPTIM6)
#define __HAL_RCC_LPTIM6_CLK_ENABLE()           do { \
                                                     __IO uint32_t tmpreg; \
                                                     SET_BIT(RCC->APB3ENR, RCC_APB3ENR_LPTIM6EN); \
                                                     /* Delay after an RCC peripheral clock enabling */ \
                                                     tmpreg = READ_BIT(RCC->APB3ENR, RCC_APB3ENR_LPTIM6EN); \
                                                     UNUSED(tmpreg); \
                                                   } while(0)
#endif /* LPTIM6 */

#if defined(VREFBUF)
#define __HAL_RCC_VREF_CLK_ENABLE()             do { \
                                                     __IO uint32_t tmpreg; \
                                                     SET_BIT(RCC->APB3ENR, RCC_APB3ENR_VREFEN); \
                                                     /* Delay after an RCC peripheral clock enabling */ \
                                                     tmpreg = READ_BIT(RCC->APB3ENR, RCC_APB3ENR_VREFEN); \
                                                     UNUSED(tmpreg); \
                                                   } while(0)
#endif /* VREFBUF */

#define __HAL_RCC_RTC_CLK_ENABLE()             do { \
                                                    __IO uint32_t tmpreg; \
                                                    SET_BIT(RCC->APB3ENR, RCC_APB3ENR_RTCAPBEN); \
                                                    /* Delay after an RCC peripheral clock enabling */ \
                                                    tmpreg = READ_BIT(RCC->APB3ENR, RCC_APB3ENR_RTCAPBEN); \
                                                    UNUSED(tmpreg); \
                                                  } while(0)

#define __HAL_RCC_SBS_CLK_DISABLE()            CLEAR_BIT(RCC->APB3ENR, RCC_APB3ENR_SBSEN)

#if defined(SPI5)
#define __HAL_RCC_SPI5_CLK_DISABLE()           CLEAR_BIT(RCC->APB3ENR, RCC_APB3ENR_SPI5EN)
#endif /* SPI5 */

#define __HAL_RCC_LPUART1_CLK_DISABLE()        CLEAR_BIT(RCC->APB3ENR, RCC_APB3ENR_LPUART1EN)

#if defined(I2C3)
#define __HAL_RCC_I2C3_CLK_DISABLE()           CLEAR_BIT(RCC->APB3ENR, RCC_APB3ENR_I2C3EN)
#endif /* I2C3 */

#if defined(I2C4)
#define __HAL_RCC_I2C4_CLK_DISABLE()           CLEAR_BIT(RCC->APB3ENR, RCC_APB3ENR_I2C4EN)
#endif /* I2C4 */

#if defined(I3C2)
#define __HAL_RCC_I3C2_CLK_DISABLE()           CLEAR_BIT(RCC->APB3ENR, RCC_APB3ENR_I3C2EN)
#endif /* I3C2 */

#define __HAL_RCC_LPTIM1_CLK_DISABLE()         CLEAR_BIT(RCC->APB3ENR, RCC_APB3ENR_LPTIM1EN)

#if defined(LPTIM3)
#define __HAL_RCC_LPTIM3_CLK_DISABLE()         CLEAR_BIT(RCC->APB3ENR, RCC_APB3ENR_LPTIM3EN)
#endif /* LPTIM3 */

#if defined(LPTIM4)
#define __HAL_RCC_LPTIM4_CLK_DISABLE()         CLEAR_BIT(RCC->APB3ENR, RCC_APB3ENR_LPTIM4EN)
#endif /* LPTIM4 */

#if defined(LPTIM5)
#define __HAL_RCC_LPTIM5_CLK_DISABLE()         CLEAR_BIT(RCC->APB3ENR, RCC_APB3ENR_LPTIM5EN)
#endif /* LPTIM5 */

#if defined(LPTIM6)
#define __HAL_RCC_LPTIM6_CLK_DISABLE()         CLEAR_BIT(RCC->APB3ENR, RCC_APB3ENR_LPTIM6EN)
#endif /* LPTIM6 */

#if defined(VREFBUF)
#define __HAL_RCC_VREF_CLK_DISABLE()           CLEAR_BIT(RCC->APB3ENR, RCC_APB3ENR_VREFEN)
#endif /* VREFBUF */

#define __HAL_RCC_RTC_CLK_DISABLE()            CLEAR_BIT(RCC->APB3ENR, RCC_APB3ENR_RTCAPBEN)

/**
  * @}
  */

/** @defgroup RCC_AHB_APB_Branch_Clock_Disable AHB APB Branch Clock Disable Clear Disable
  * @brief  Disable or clear Disable the AHBx/APBx branch clock for all AHBx/APBx peripherals.
  * @note   It is recommended to disable the clock of all peripherals (by writing 0 in
  *         the AHBxENR/APBxENR register) before Disabling the corresponding Bus Branch clock.
  *         Some peripheral bus clocks are not affected by branch clock disabling as IWDG (APB1),
  *         SRAM2/SRAM3 (AHB2) and FLITF/BKRAM/ICACHE/DCACHE/SRAM1 (AHB1).
  * @{
  */

#define __HAL_RCC_AHB1_CLK_DISABLE()         do { \
                                                  __IO uint32_t tmpreg; \
                                                  SET_BIT(RCC->CFGR2, RCC_CFGR2_AHB1DIS); \
                                                  /* Delay after AHB peripherals bus clocks branch disable */ \
                                                  tmpreg = READ_BIT(RCC->CFGR2, RCC_CFGR2_AHB1DIS); \
                                                  UNUSED(tmpreg); \
                                                } while(0)

#define __HAL_RCC_AHB2_CLK_DISABLE()         do { \
                                                  __IO uint32_t tmpreg; \
                                                  SET_BIT(RCC->CFGR2, RCC_CFGR2_AHB2DIS); \
                                                  /* Delay after AHB peripherals bus clocks branch disable */ \
                                                  tmpreg = READ_BIT(RCC->CFGR2, RCC_CFGR2_AHB2DIS); \
                                                  UNUSED(tmpreg); \
                                                } while(0)

#if defined(AHB4PERIPH_BASE)
#define __HAL_RCC_AHB4_CLK_DISABLE()         do { \
                                                  __IO uint32_t tmpreg; \
                                                  SET_BIT(RCC->CFGR2, RCC_CFGR2_AHB4DIS); \
                                                  /* Delay after AHB peripherals bus clocks branch disable  */ \
                                                  tmpreg = READ_BIT(RCC->CFGR2, RCC_CFGR2_AHB4DIS); \
                                                  UNUSED(tmpreg); \
                                                } while(0)
#endif /* AHB4PERIPH_BASE */

#define __HAL_RCC_APB1_CLK_DISABLE()         do { \
                                                  __IO uint32_t tmpreg; \
                                                  SET_BIT(RCC->CFGR2, RCC_CFGR2_APB1DIS); \
                                                  /* Delay after APB peripherals bus clocks branch disable */ \
                                                  tmpreg = READ_BIT(RCC->CFGR2, RCC_CFGR2_APB1DIS); \
                                                  UNUSED(tmpreg); \
                                                } while(0)

#define __HAL_RCC_APB2_CLK_DISABLE()         do { \
                                                  __IO uint32_t tmpreg; \
                                                  SET_BIT(RCC->CFGR2, RCC_CFGR2_APB2DIS); \
                                                  /* Delay after APB peripherals bus clocks branch disable  */ \
                                                  tmpreg = READ_BIT(RCC->CFGR2, RCC_CFGR2_APB2DIS); \
                                                  UNUSED(tmpreg); \
                                                } while(0)

#define __HAL_RCC_APB3_CLK_DISABLE()         do { \
                                                  __IO uint32_t tmpreg; \
                                                  SET_BIT(RCC->CFGR2, RCC_CFGR2_APB3DIS); \
                                                  /* Delay after APB peripherals bus clocks branch disable  */ \
                                                  tmpreg = READ_BIT(RCC->CFGR2, RCC_CFGR2_APB3DIS); \
                                                  UNUSED(tmpreg); \
                                                } while(0)


